In [1]:
# using pandas to create a dataframe out of a dictionary
people = {"first":["lahm", "ricky", "bianca"],
         "last": ["wang", "wang", "yue"],
         "email":["lahmwang@email.com", "rickywang@email.com", "biancayue@email.com"]}

In [2]:
import pandas as pd
import numpy as np

In [3]:
df = pd.DataFrame(people)

In [4]:
df

    first  last                email
0    lahm  wang   lahmwang@email.com
1   ricky  wang  rickywang@email.com
2  bianca   yue  biancayue@email.com

In [5]:
# getting access to the "email" column
df["email"]

0     lahmwang@email.com
1    rickywang@email.com
2    biancayue@email.com
Name: email, dtype: object

In [6]:
# type: series - a single column of rows
type(df["email"])

pandas.core.series.Series

In [7]:
# same output as above, but a different way
df.email

0     lahmwang@email.com
1    rickywang@email.com
2    biancayue@email.com
Name: email, dtype: object

In [8]:
# access multiple columns
df[["last", "email"]]

   last                email
0  wang   lahmwang@email.com
1  wang  rickywang@email.com
2   yue  biancayue@email.com

In [9]:
# check all the columns headings
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [10]:
# searching for specific rows using integer location (iloc)
# get one specific row
df.iloc[0]

first                  lahm
last                   wang
email    lahmwang@email.com
Name: 0, dtype: object

In [11]:
# get multiple rows
df.iloc[[0,2]]

    first  last                email
0    lahm  wang   lahmwang@email.com
2  bianca   yue  biancayue@email.com

In [12]:
# get a column within selected rows
df.iloc[[0,2], 2]

0     lahmwang@email.com
2    biancayue@email.com
Name: email, dtype: object

In [13]:
# get multiple columns within selected rows
df.iloc[[0,2], [1,2]]

   last                email
0  wang   lahmwang@email.com
2   yue  biancayue@email.com

In [14]:
# searching for specific rows using labels (loc)
# get one specific row
df.loc[0]

first                  lahm
last                   wang
email    lahmwang@email.com
Name: 0, dtype: object

In [15]:
# get multiple rows
df.loc[[0,1]]

   first  last                email
0   lahm  wang   lahmwang@email.com
1  ricky  wang  rickywang@email.com

In [16]:
# get column(s) within selected rows
df.loc[[0,1], ["email", "first", "last"]]

                 email  first  last
0   lahmwang@email.com   lahm  wang
1  rickywang@email.com  ricky  wang

In [17]:
# set the email as the index (not in-place change)
df.set_index("email")

                      first  last
email
lahmwang@email.com     lahm  wang
rickywang@email.com   ricky  wang
biancayue@email.com  bianca   yue

In [18]:
# set the email as the index (in-place change)
df.set_index("email", inplace = True)
df

                      first  last
email
lahmwang@email.com     lahm  wang
rickywang@email.com   ricky  wang
biancayue@email.com  bianca   yue

In [19]:
# access the rows using iloc
df.iloc[0]
# will lead to error if use df.loc[0] because the index has changed to "email"

first    lahm
last     wang
Name: lahmwang@email.com, dtype: object

In [20]:
# access columns and rows using loc
# the first argument is the row we want, the second argument is the column we want
df.loc["lahmwang@email.com", "first"]

'lahm'

In [21]:
# reset the index and dataframe
df.reset_index(inplace = True)
df

                 email   first  last
0   lahmwang@email.com    lahm  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [22]:
# filter out some rows with specific criteria
filt = (df["last"] == "wang")

In [23]:
df[filt]

                 email  first  last
0   lahmwang@email.com   lahm  wang
1  rickywang@email.com  ricky  wang

In [24]:
# same effect as the previous one
df.loc[filt]

                 email  first  last
0   lahmwang@email.com   lahm  wang
1  rickywang@email.com  ricky  wang

In [25]:
# but with loc, we can access specific columns on the basis of selected rows
df.loc[filt, "email"]

0     lahmwang@email.com
1    rickywang@email.com
Name: email, dtype: object

In [26]:
# filter with multiple conditions
# and
filt_1 = (df["last"] == "wang") & (df["first"] == "ricky")
df.loc[filt_1, "email"]

1    rickywang@email.com
Name: email, dtype: object

In [27]:
# or
filt_1 = (df["last"] == "yue") | (df["first"] == "ricky")
df.loc[filt_1, "email"]

1    rickywang@email.com
2    biancayue@email.com
Name: email, dtype: object

In [28]:
# negation
filt_1 = (df["last"] == "yue") | (df["first"] == "ricky")
df.loc[~filt_1, "email"]

0    lahmwang@email.com
Name: email, dtype: object

In [29]:
# renaming the column (need to update all columns)
df.columns = ["email", "first name", "last name"]
df

                 email first name last name
0   lahmwang@email.com       lahm      wang
1  rickywang@email.com      ricky      wang
2  biancayue@email.com     bianca       yue

In [30]:
# making all letters in the column uppercase
df.columns = [x.upper() for x in df.columns]
df

                 EMAIL FIRST NAME LAST NAME
0   lahmwang@email.com       lahm      wang
1  rickywang@email.com      ricky      wang
2  biancayue@email.com     bianca       yue

In [31]:
# replacing all the spaces in the column with "_"
df.columns = df.columns.str.replace(' ', '_')
df

                 EMAIL FIRST_NAME LAST_NAME
0   lahmwang@email.com       lahm      wang
1  rickywang@email.com      ricky      wang
2  biancayue@email.com     bianca       yue

In [32]:
# rename some of the columns using a dictionary
df.columns = [x.lower() for x in df.columns]
# by default, it is not in-place
df.rename(columns = {'first_name': 'first', 'last_name': 'last'})

                 email   first  last
0   lahmwang@email.com    lahm  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [33]:
# in-place editing the columns
df.rename(columns = {'first_name': 'first', 'last_name': 'last'}, inplace = True)
df

                 email   first  last
0   lahmwang@email.com    lahm  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [34]:
# change some information in a row (need to update all cells in this row)
df.loc[0] = ["lahmlahm@email.com", "lahm", "lahm"]
df

                 email   first  last
0   lahmlahm@email.com    lahm  lahm
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [35]:
# partly change some information in a row
df.loc[0, ["email", "last"]] = ["lahmwang@email.com", "wang"]
df

                 email   first  last
0   lahmwang@email.com    lahm  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [36]:
# change one element's value
# using loc
df.loc[2, "first"] = "beyond"
df

                 email   first  last
0   lahmwang@email.com    lahm  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  beyond   yue

In [37]:
# using at (very similar to loc)
df.at[2, "first"] = "bianca"
df

                 email   first  last
0   lahmwang@email.com    lahm  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [38]:
# an error will happen when trying to change an element using the following way:
filt = (df["email"] == "lahmwang@email.com")
df[filt]["first"] = "wow"

/Users/lahmwang/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy
  This is separate from the ipykernel package so we can avoid doing imports until

In [39]:
# a correct way
filt = (df["email"] == "lahmwang@email.com")
df.loc[filt, "first"] = "wow"
df

                 email   first  last
0   lahmwang@email.com     wow  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [40]:
# change multiple rows' values
df["last"] = df["last"].str.upper()
df

                 email   first  last
0   lahmwang@email.com     wow  WANG
1  rickywang@email.com   ricky  WANG
2  biancayue@email.com  bianca   YUE

In [41]:
# apply: applying a function on series objects
df["email"].apply(len)

0    18
1    19
2    19
Name: email, dtype: int64

In [42]:
# define a function and apply it to one series object
def lower_last(last):
    return last.lower()
df["last"] = df["last"].apply(lower_last)
df

                 email   first  last
0   lahmwang@email.com     wow  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [43]:
# apply a function to the whole dataframe
# get the min value of each column heading
df.apply(pd.Series.min)

email    biancayue@email.com
first                 bianca
last                    wang
dtype: object

In [44]:
# using lambda function to get the same effect
df.apply(lambda x: x.min())

email    biancayue@email.com
first                 bianca
last                    wang
dtype: object

In [45]:
# applymap: apply a function to every cell of the dataframe
df.applymap(len)

   email  first  last
0     18      3     4
1     19      5     4
2     19      6     3

In [46]:
df.applymap(str.upper)

                 email   first  last
0   LAHMWANG@EMAIL.COM     WOW  WANG
1  RICKYWANG@EMAIL.COM   RICKY  WANG
2  BIANCAYUE@EMAIL.COM  BIANCA   YUE

In [47]:
# map: replace all the values in a column with some new ones (the not-mentioned ones will be NaN)
df["first"].map({"wow": "lahm", "bianca": "beyond"})

0      lahm
1       NaN
2    beyond
Name: first, dtype: object

In [48]:
# replace: replace all the mentioned values with new ones, while keeping other ones the same
df["first"].replace({"wow": "lahm", "bianca": "beyond"})

0      lahm
1     ricky
2    beyond
Name: first, dtype: object

In [49]:
# make replace changes on the actual dataframe
df["first"] = df["first"].replace({"wow": "lahm"})
df

                 email   first  last
0   lahmwang@email.com    lahm  wang
1  rickywang@email.com   ricky  wang
2  biancayue@email.com  bianca   yue

In [50]:
# adding a new column called full_name
# cannot use "." method of calling columns
df["full_name"] = df["first"] + " " + df["last"]
df

                 email   first  last   full_name
0   lahmwang@email.com    lahm  wang   lahm wang
1  rickywang@email.com   ricky  wang  ricky wang
2  biancayue@email.com  bianca   yue  bianca yue

In [51]:
# removing column(s)
# not in-place, if want to make change directly to dataframe, write inplace=True
df.drop(columns = ["first", "last"])

                 email   full_name
0   lahmwang@email.com   lahm wang
1  rickywang@email.com  ricky wang
2  biancayue@email.com  bianca yue

In [52]:
# in-place delete the first name and last name columns
df.drop(columns = ["first", "last"], inplace = True)
df

                 email   full_name
0   lahmwang@email.com   lahm wang
1  rickywang@email.com  ricky wang
2  biancayue@email.com  bianca yue

In [53]:
# recover the first name and last name columns
# the expand method of split: assigning the split values to separate columns
df["full_name"].str.split(" ", expand = True)

        0     1
0    lahm  wang
1   ricky  wang
2  bianca   yue

In [54]:
# assign the expanded columns to first name and last name columns
df[["first", "last"]] = df["full_name"].str.split(" ", expand = True)
df

                 email   full_name   first  last
0   lahmwang@email.com   lahm wang    lahm  wang
1  rickywang@email.com  ricky wang   ricky  wang
2  biancayue@email.com  bianca yue  bianca   yue

In [55]:
# creating a new row
# the mentioned values will be set, and the unmentioned values will be set to NaN (with ignore_index=True)
# not in-place, have to assign df = df.append to make the changes
df.append({"first": "Tony"}, ignore_index = True)

                 email   full_name   first  last
0   lahmwang@email.com   lahm wang    lahm  wang
1  rickywang@email.com  ricky wang   ricky  wang
2  biancayue@email.com  bianca yue  bianca   yue
3                  NaN         NaN    Tony   NaN

In [56]:
# creating a new dataframe and merge into the current dataframe
new_people = {"first":["harry", "tony"],
         "last": ["potter", "stark"],
         "email":["harrypotter@email.com", "tonystark@email.com"]}
df2 = pd.DataFrame(new_people)
df2

   first    last                  email
0  harry  potter  harrypotter@email.com
1   tony   stark    tonystark@email.com

In [57]:
# use append to merge df2 to df (without sorting the columns)
df.append(df2, ignore_index = True, sort = False)

                   email   full_name   first    last
0     lahmwang@email.com   lahm wang    lahm    wang
1    rickywang@email.com  ricky wang   ricky    wang
2    biancayue@email.com  bianca yue  bianca     yue
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark

In [58]:
# make the actual change on the df
df = df.append(df2, ignore_index = True, sort = False)
df

                   email   full_name   first    last
0     lahmwang@email.com   lahm wang    lahm    wang
1    rickywang@email.com  ricky wang   ricky    wang
2    biancayue@email.com  bianca yue  bianca     yue
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark

In [59]:
# delete some row(s)
df.drop(index = 3)

                 email   full_name   first   last
0   lahmwang@email.com   lahm wang    lahm   wang
1  rickywang@email.com  ricky wang   ricky   wang
2  biancayue@email.com  bianca yue  bianca    yue
4  tonystark@email.com         NaN    tony  stark

In [60]:
# use filter to delete some rows with specific conditions
filt = df["last"] == "wang"
df.drop(index = df[filt].index)

                   email   full_name   first    last
2    biancayue@email.com  bianca yue  bianca     yue
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark

In [61]:
# sort the values by last name, in ascending order
# not in-place, add inplace=True to make in-place change
df.sort_values(by = "last")

                   email   full_name   first    last
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark
0     lahmwang@email.com   lahm wang    lahm    wang
1    rickywang@email.com  ricky wang   ricky    wang
2    biancayue@email.com  bianca yue  bianca     yue

In [62]:
# sort the values by last name, in descending order
df.sort_values(by = "last", ascending = False)

                   email   full_name   first    last
2    biancayue@email.com  bianca yue  bianca     yue
0     lahmwang@email.com   lahm wang    lahm    wang
1    rickywang@email.com  ricky wang   ricky    wang
4    tonystark@email.com         NaN    tony   stark
3  harrypotter@email.com         NaN   harry  potter

In [63]:
# the sorting priority is 1. last name, 2. first name
df.sort_values(by = ["last", "first"])

                   email   full_name   first    last
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark
0     lahmwang@email.com   lahm wang    lahm    wang
1    rickywang@email.com  ricky wang   ricky    wang
2    biancayue@email.com  bianca yue  bianca     yue

In [64]:
# sorting last name by ascending order, and first name by descending order
df.sort_values(by = ["last", "first"], ascending = [True, False], inplace = True)
df

                   email   full_name   first    last
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark
1    rickywang@email.com  ricky wang   ricky    wang
0     lahmwang@email.com   lahm wang    lahm    wang
2    biancayue@email.com  bianca yue  bianca     yue

In [65]:
# sort the rows by the index
# not in-place
df.sort_index()

                   email   full_name   first    last
0     lahmwang@email.com   lahm wang    lahm    wang
1    rickywang@email.com  ricky wang   ricky    wang
2    biancayue@email.com  bianca yue  bianca     yue
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark

In [66]:
df.sort_index(inplace=True)
df

                   email   full_name   first    last
0     lahmwang@email.com   lahm wang    lahm    wang
1    rickywang@email.com  ricky wang   ricky    wang
2    biancayue@email.com  bianca yue  bianca     yue
3  harrypotter@email.com         NaN   harry  potter
4    tonystark@email.com         NaN    tony   stark

In [67]:
# sort one column
df["last"].sort_values()

3    potter
4     stark
0      wang
1      wang
2       yue
Name: last, dtype: object

In [68]:
# create a new dataframe to practice data cleaning
ppl = {'first': ['Corey', 'Jane', 'John', 'Chris', np.nan, None, 'NA'], 
    'last': ['Schafer', 'Doe', 'Doe', 'Schafer', np.nan, np.nan, 'Missing'], 
    'email': ['CoreyMSchafer@gmail.com', 'JaneDoe@email.com', 'JohnDoe@email.com', None, np.nan, 'Anonymous@email.com', 'NA'],
    'age': ['33', '55', '63', '36', None, None, 'Missing']
}
df = pd.DataFrame(ppl)
df

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [69]:
# drop the rows that has NaN values inside
# axis: "index" - drop rows with missing values; "columns" - drop columns with missing values
# how: "any" - drop the row if some of the values are missing; "all" - drop the row if all values are missing
df.dropna(axis = "index", how = "any")

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
6     NA  Missing                       NA  Missing

In [70]:
df.dropna(axis = "columns", how = "all")

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
3  Chris  Schafer                     None       36
4    NaN      NaN                      NaN     None
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [71]:
# subset: the columns we are looking for missing values (must set axis = "index" because we are deleting rows)
df.dropna(axis = "index", subset = ["email"])

   first     last                    email      age
0  Corey  Schafer  CoreyMSchafer@gmail.com       33
1   Jane      Doe        JaneDoe@email.com       55
2   John      Doe        JohnDoe@email.com       63
5   None      NaN      Anonymous@email.com     None
6     NA  Missing                       NA  Missing

In [72]:
# if we are using a dictionary to create dataframe, we can use replace to handle different missing values
df.replace("NA", np.nan, inplace = True)
df.replace("Missing", np.nan, inplace = True)
df

   first     last                    email   age
0  Corey  Schafer  CoreyMSchafer@gmail.com    33
1   Jane      Doe        JaneDoe@email.com    55
2   John      Doe        JohnDoe@email.com    63
3  Chris  Schafer                     None    36
4    NaN      NaN                      NaN  None
5   None      NaN      Anonymous@email.com  None
6    NaN      NaN                      NaN   NaN

In [73]:
# then all the missing values will be treated
df.dropna()

   first     last                    email age
0  Corey  Schafer  CoreyMSchafer@gmail.com  33
1   Jane      Doe        JaneDoe@email.com  55
2   John      Doe        JohnDoe@email.com  63

In [74]:
# see whether all the cells in the dataframe are classified as Na or not
df.isna()

   first   last  email    age
0  False  False  False  False
1  False  False  False  False
2  False  False  False  False
3  False  False   True  False
4   True   True   True   True
5   True   True  False   True
6   True   True   True   True

In [75]:
# fill all the Na values with some customized values
# for example, when processing scores, all the Na can be marked as 0
df.fillna("MISSING")

     first     last                    email      age
0    Corey  Schafer  CoreyMSchafer@gmail.com       33
1     Jane      Doe        JaneDoe@email.com       55
2     John      Doe        JohnDoe@email.com       63
3    Chris  Schafer                  MISSING       36
4  MISSING  MISSING                  MISSING  MISSING
5  MISSING  MISSING      Anonymous@email.com  MISSING
6  MISSING  MISSING                  MISSING  MISSING

In [76]:
# calculate the average age
# the age are expressed as string, and the type of Na values are actually float
# we can convert all the values in age as float
df["age"] = df["age"].astype(float)
df["age"].mean()

46.75

In [78]:
# change the order of columns
df = df[["email", "first", "last", "age"]]
df

                     email  first     last   age
0  CoreyMSchafer@gmail.com  Corey  Schafer  33.0
1        JaneDoe@email.com   Jane      Doe  55.0
2        JohnDoe@email.com   John      Doe  63.0
3                     None  Chris  Schafer  36.0
4                      NaN    NaN      NaN   NaN
5      Anonymous@email.com   None      NaN   NaN
6                      NaN    NaN      NaN   NaN

In [79]:
# change the index to start from 1
df.index = range(1, len(df) + 1)
df

                     email  first     last   age
1  CoreyMSchafer@gmail.com  Corey  Schafer  33.0
2        JaneDoe@email.com   Jane      Doe  55.0
3        JohnDoe@email.com   John      Doe  63.0
4                     None  Chris  Schafer  36.0
5                      NaN    NaN      NaN   NaN
6      Anonymous@email.com   None      NaN   NaN
7                      NaN    NaN      NaN   NaN